# _**Pandas(Panel Data) Nedir?**_

* Panel veri = zaman indeksini daha fazla önemseyen
* Veri manipülasyonu ve veri analizi için yazılmış açık kaynak kodlu bir Py kütüphanesi
* Ekonometrik ve finansal çalışmalar için doğmuştur.
* R DataFrame yapısını Py dünyasına taşımış ve DataFrame'ler üzerinde hızlı ve etkili çalışabilme imkanı sağlamıştır.
* Birçok veri tipini okumaya ve işlemeye yarar.

## **Pandas Serisi Oluşturmak**

* NumPy serilerinden değerleri indexi ile beraber saklamasıdır.

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [3]:
seri = pd.Series([1,2,3,4,5])

In [4]:
type(seri)

pandas.core.series.Series

In [5]:
seri.axes

[RangeIndex(start=0, stop=5, step=1)]

In [6]:
seri.dtype

dtype('int64')

In [7]:
seri.size

5

In [8]:
seri.ndim

1

In [9]:
seri.shape

(5,)

In [14]:
seri.values  # pd.series'i np.array formatında görüntülemek için

array([1, 2, 3, 4, 5], dtype=int64)

In [12]:
seri.head()

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [13]:
seri.tail()

0    1
1    2
2    3
3    4
4    5
dtype: int64

### **Index İsimlendirmesi**

In [16]:
pd.Series([99,22,332,94,5], index=[1,3,5,7,9])

1     99
3     22
5    332
7     94
9      5
dtype: int64

In [19]:
seri = pd.Series([99,22,332,94,5], index=["a","b","c","d","e"])

In [20]:
seri["a"]

99

In [21]:
seri["a":"c"]

a     99
b     22
c    332
dtype: int64

In [24]:
dict1 = pd.Series({"reg":10, "log":11, "cart":12})

In [25]:
dict1

reg     10
log     11
cart    12
dtype: int64

In [26]:
dict2 = {"reg":10, "log":11, "cart":12}

In [29]:
series = pd.Series(dict2)  # dict'i direkt pd array i yapmak

In [28]:
series

reg     10
log     11
cart    12
dtype: int64

In [30]:
# iki seriyi birleştirerek seri oluşturma

In [31]:
pd.concat([seri,series])

a        99
b        22
c       332
d        94
e         5
reg      10
log      11
cart     12
dtype: int64

## **Eleman İşlemleri**

In [34]:
import numpy as np
a = np.array([1,25,13,34,59])
seri = pd.Series(a)
seri

0     1
1    25
2    13
3    34
4    59
dtype: int32

In [35]:
seri[0]

1

In [36]:
seri[0:3]

0     1
1    25
2    13
dtype: int32

In [37]:
seri = pd.Series([123,200,150,99], index = ["reg","loj","cart","rf"])

In [38]:
seri

reg     123
loj     200
cart    150
rf       99
dtype: int64

In [39]:
seri.index

Index(['reg', 'loj', 'cart', 'rf'], dtype='object')

In [40]:
seri.keys

<bound method Series.keys of reg     123
loj     200
cart    150
rf       99
dtype: int64>

In [41]:
list(seri.items())

[('reg', 123), ('loj', 200), ('cart', 150), ('rf', 99)]

In [42]:
seri.values

array([123, 200, 150,  99], dtype=int64)

In [43]:
# eleman sorgulama

In [44]:
"reg" in seri

True

In [45]:
"a" in seri

False

In [46]:
seri["reg"]

123

In [47]:
# fancy eleman

In [48]:
seri[["rf","reg"]]

rf      99
reg    123
dtype: int64

In [49]:
seri["reg"] = 130

In [50]:
seri["reg"]

130

In [51]:
seri["reg":"loj"]

reg    130
loj    200
dtype: int64

### **Pandas DataFrame Oluşturma**

* NumPy'da fix data type olduğu için ihtiyaç duyulan ileri seviye manipülasyona müsade etmiyor
* Pandas kullanılsa bile arkada NumPy kullanır.
* Pandas daha analitik anlamda düşünülmelidir.

In [52]:
import pandas as pd
l = [1,2,6,134,513,23]
l

[1, 2, 6, 134, 513, 23]

In [53]:
pd.DataFrame(l,columns=["degisken_ismi"])

   degisken_ismi
0              1
1              2
2              6
3            134
4            513
5             23

In [54]:
import numpy as np
m = np.arange(1,10).reshape((3,3))
m

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [55]:
pd.DataFrame(m,columns=["var1","var2","var3"])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [56]:
# DF isimlendirme

In [57]:
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [60]:
df.columns = ("deg1" , "deg2","deg3")

In [61]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [62]:
type(df)

pandas.core.frame.DataFrame

In [63]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [64]:
df.shape

(3, 3)

In [65]:
df.ndim

2

In [66]:
df.size

9

In [67]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [70]:
type(df.values)   # values u numpy array cinsiyle saklar.

numpy.ndarray

In [71]:
a = np.array([1,2,3,4,5])

In [72]:
pd.DataFrame(a, columns=["deg1"])

   deg1
0     1
1     2
2     3
3     4
4     5

### DataFrame Eleman İşlemleri

In [73]:
s1 = np.random.randint(10,size =5)
s2 = np.random.randint(10,size =5)
s3 = np.random.randint(10,size =5)

In [74]:
sozluk = {"var1": s1, "var2":s2, "var3":s3}

In [79]:
df = pd.DataFrame(sozluk)
df

   var1  var2  var3
0     2     0     0
1     3     2     1
2     7     9     4
3     9     9     7
4     5     2     5

In [80]:
df[0:1]

   var1  var2  var3
0     2     0     0

In [81]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [82]:
df.index = ["a","b","c","d","e"]

In [83]:
df

   var1  var2  var3
a     2     0     0
b     3     2     1
c     7     9     4
d     9     9     7
e     5     2     5

In [84]:
df["a":"b"]

   var1  var2  var3
a     2     0     0
b     3     2     1

In [85]:
# silme

In [86]:
df.drop("a",axis=0)    # axis=0 yaparak a indexinin tüm satırı silinir.

   var1  var2  var3
b     3     2     1
c     7     9     4
d     9     9     7
e     5     2     5

In [88]:
df    # ana df'te değişiklik olmadı.

   var1  var2  var3
a     2     0     0
b     3     2     1
c     7     9     4
d     9     9     7
e     5     2     5

In [92]:
df.drop("b",axis=0,inplace=True)    # yapılan değişiklikleri kalıcı hale geti

In [93]:
df

   var1  var2  var3
c     7     9     4
d     9     9     7
e     5     2     5

In [94]:
#fancy ile droplama

In [95]:
l = ["c","e"]

In [96]:
df.drop(l,axis=0)

   var1  var2  var3
d     9     9     7

In [97]:
# değişkenler için

In [98]:
"var1" in df

True

In [99]:
l = ["var1","var2","var4"]

In [101]:
for i in l:
    print(i in df)

True
True
False

In [102]:
df

   var1  var2  var3
c     7     9     4
d     9     9     7
e     5     2     5

In [105]:
df["var4"] = df["var1"] / df["var2"]

In [106]:
df

   var1  var2  var3      var4
c     7     9     4  0.777778
d     9     9     7  1.000000
e     5     2     5  2.500000

In [107]:
# değişken silme

In [108]:
df.drop("var4", axis=1)

   var1  var2  var3
c     7     9     4
d     9     9     7
e     5     2     5

In [109]:
df

   var1  var2  var3      var4
c     7     9     4  0.777778
d     9     9     7  1.000000
e     5     2     5  2.500000

In [110]:
df.drop("var4", axis=1, inplace = True)

In [111]:
df

   var1  var2  var3
c     7     9     4
d     9     9     7
e     5     2     5

In [112]:
l = ["var1","var2"]

In [113]:
df.drop(l,axis=1)

   var3
c     4
d     7
e     5

### **Gözlem ve Değişken Seçimi: loc & iloc**

In [117]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size=(10,3))
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     1    27     6
1    29    22    15
2     8    28    11
3     8     1     5
4    18    11    22
5    14     2    14
6    19     2    29
7    23     9    22
8    29    22    29
9    19    24    12

In [122]:
#loc: tanımladığı şekilde seçim yapmak için kullanılır. : ' dan sonraki değeri 
# de dahil eder.

In [119]:
df.loc[0:3]

   var1  var2  var3
0     1    27     6
1    29    22    15
2     8    28    11
3     8     1     5

In [120]:
#iloc: alışık olduğumuz indexleme mantığıyla seçim yapmak için kullanılır.

In [121]:
df.iloc[0:3]

   var1  var2  var3
0     1    27     6
1    29    22    15
2     8    28    11

In [123]:
df.iloc[0,0]

1

In [124]:
df.iloc[0:3,0:2]

   var1  var2
0     1    27
1    29    22
2     8    28

In [126]:
df.loc[:3,"var3"]  #mutlak anlamda indexlere sadık kalacak şekilde

0     6
1    15
2    11
3     5
Name: var3, dtype: int32

### **Koşullu Eleman İşlemleri**

In [127]:
df["var1"]

0     1
1    29
2     8
3     8
4    18
5    14
6    19
7    23
8    29
9    19
Name: var1, dtype: int32

In [128]:
df[0:2][["var1","var2"]]

   var1  var2
0     1    27
1    29    22

In [141]:
df[(df.var1 > 15) & (df.var2 > 2) ]

   var1  var2  var3
1    29    22    15
4    18    11    22
7    23     9    22
8    29    22    29
9    19    24    12

In [142]:
df.loc[(df.var1 > 15),["var1","var2"]]

   var1  var2
1    29    22
4    18    11
6    19     2
7    23     9
8    29    22
9    19    24

### **Birleştirme(Join) İşlemleri**

In [143]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size=(5,3))
df = pd.DataFrame(m,columns=["var1","var2","var3"])
df

   var1  var2  var3
0     3     5    21
1    11    11    22
2    22    17    16
3     4     2     6
4    10    15    19

In [144]:
df1 = df + 99

In [147]:
pd.concat([df1,df])

   var1  var2  var3
0   102   104   120
1   110   110   121
2   121   116   115
3   103   101   105
4   109   114   118
0     3     5    21
1    11    11    22
2    22    17    16
3     4     2     6
4    10    15    19

In [153]:
df2 = pd.concat([df1,df],ignore_index=True)   # index problemi ortadan kalktı.

In [152]:
df2

   var1  var2  var3
0   102   104   120
1   110   110   121
2   121   116   115
3   103   101   105
4   109   114   118
5     3     5    21
6    11    11    22
7    22    17    16
8     4     2     6
9    10    15    19

## **İleri Birleştirme İşlemleri**

In [1]:
#birebir birleştirme

In [3]:
import pandas as pd
df1 = pd.DataFrame({'calisanlar':['Ali',"Veli","Ayse","Fatma"],
                   "grup":["Muhasebe","Muhendislik","Muhendislik","IK"]})
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [5]:
df2= pd.DataFrame({'calisanlar':['Ali',"Veli","Ayse","Fatma"],
                   "ilk_giris":[2010,2009,2014,2019]})

df2

  calisanlar  ilk_giris
0        Ali       2010
1       Veli       2009
2       Ayse       2014
3      Fatma       2019

In [7]:
pd.merge(df1,df2)

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [11]:
pd.merge(df1,df2,on="calisanlar")  # hangi grup üzerinde birleşmesin istiyorsan
#on parametresi kullanılır.

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [12]:
#many to one

In [13]:
df3 = pd.merge(df1,df2)

In [14]:
df3

  calisanlar         grup  ilk_giris
0        Ali     Muhasebe       2010
1       Veli  Muhendislik       2009
2       Ayse  Muhendislik       2014
3      Fatma           IK       2019

In [16]:
df4 = pd.DataFrame({"grup":['Muhasebe',"Muhendislik","IK"],
                   "mudur": ["Caner","Mustafa","Berkcan"]})
df4

          grup    mudur
0     Muhasebe    Caner
1  Muhendislik  Mustafa
2           IK  Berkcan

In [17]:
pd.merge(df3,df4)  # ortak değişken üzerinde birleşmesini bekleriz

  calisanlar         grup  ilk_giris    mudur
0        Ali     Muhasebe       2010    Caner
1       Veli  Muhendislik       2009  Mustafa
2       Ayse  Muhendislik       2014  Mustafa
3      Fatma           IK       2019  Berkcan

In [18]:
#many to many

In [19]:
df5 = pd.DataFrame({"grup":["Muhasebe","Muhasebe","Muhendislik","Muhendislik",
                           "IK","IK"],
                   "yetenekler":["Matematik","Excel","Kodlama","Linux","Excel",
                                "Yonetim"]})
df5

          grup yetenekler
0     Muhasebe  Matematik
1     Muhasebe      Excel
2  Muhendislik    Kodlama
3  Muhendislik      Linux
4           IK      Excel
5           IK    Yonetim

In [20]:
df1

  calisanlar         grup
0        Ali     Muhasebe
1       Veli  Muhendislik
2       Ayse  Muhendislik
3      Fatma           IK

In [22]:
pd.merge(df1,df5)   #coklayarak her birinin grup ve yetenekleri eşledi

  calisanlar         grup yetenekler
0        Ali     Muhasebe  Matematik
1        Ali     Muhasebe      Excel
2       Veli  Muhendislik    Kodlama
3       Veli  Muhendislik      Linux
4       Ayse  Muhendislik    Kodlama
5       Ayse  Muhendislik      Linux
6      Fatma           IK      Excel
7      Fatma           IK    Yonetim

### **Toplulaştırma ve Gruplama(Aggregation & Grouping)**

#### **Toplulaştırma**

Basit toplulaştırma metotları:
* count()
* first()
* last()
* mean()
* median()
* min()
* max()
* std()
* var()
* sum()

In [23]:
import seaborn as sns

In [24]:
df = sns.load_dataset("planets")

In [34]:
df.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [30]:
df.shape

(1035, 6)

In [31]:
df.mean()

number               1.785507
orbital_period    2002.917596
mass                 2.638161
distance           264.069282
year              2009.070531
dtype: float64

In [32]:
df["mass"].mean()

2.6381605847953233

In [33]:
df.describe().T

,count,mean,std,min,25%,50%,75%,max
number,1035.0,1.785507,1.240976,1.000000,1.00000,1.0000,2.000,7.0
orbital_period,992.0,2002.917596,26014.728304,0.090706,5.44254,39.9795,526.005,730000.0
mass,513.0,2.638161,3.818617,0.003600,0.22900,1.2600,3.040,25.0
distance,808.0,264.069282,733.116493,1.350000,32.56000,55.2500,178.500,8500.0
year,1035.0,2009.070531,3.972567,1989.000000,2007.00000,2010.0000,2012.000,2014.0

In [36]:
df.dropna().describe().T

,count,mean,std,min,25%,50%,75%,max
number,498.0,1.734940,1.175720,1.0000,1.00000,1.000,2.0000,6.0
orbital_period,498.0,835.778671,1469.128259,1.3283,38.27225,357.000,999.6000,17337.5
mass,498.0,2.509320,3.636274,0.0036,0.21250,1.245,2.8675,25.0
distance,498.0,52.068213,46.596041,1.3500,24.49750,39.940,59.3325,354.0
year,498.0,2007.377510,4.167284,1989.0000,2005.00000,2009.000,2011.0000,2014.0

#### **Gruplama İşlemleri**

In [37]:
# kategorik veriler için kullanılır

In [40]:
df = sns.load_dataset("planets")
df

               method  number  orbital_period   mass  distance  year
0     Radial Velocity       1      269.300000   7.10     77.40  2006
1     Radial Velocity       1      874.774000   2.21     56.95  2008
2     Radial Velocity       1      763.000000   2.60     19.84  2011
3     Radial Velocity       1      326.030000  19.40    110.62  2007
4     Radial Velocity       1      516.220000  10.50    119.47  2009
...               ...     ...             ...    ...       ...   ...
1030          Transit       1        3.941507    NaN    172.00  2006
1031          Transit       1        2.615864    NaN    148.00  2007
1032          Transit       1        3.191524    NaN    174.00  2007
1033          Transit       1        4.125083    NaN    293.00  2008
1034          Transit       1        4.187757    NaN    260.00  2008

[1035 rows x 6 columns]

In [41]:
df.dropna()

              method  number  orbital_period    mass  distance  year
0    Radial Velocity       1       269.30000   7.100     77.40  2006
1    Radial Velocity       1       874.77400   2.210     56.95  2008
2    Radial Velocity       1       763.00000   2.600     19.84  2011
3    Radial Velocity       1       326.03000  19.400    110.62  2007
4    Radial Velocity       1       516.22000  10.500    119.47  2009
..               ...     ...             ...     ...       ...   ...
640  Radial Velocity       1       111.70000   2.100     14.90  2009
641  Radial Velocity       1         5.05050   1.068     44.46  2013
642  Radial Velocity       1       311.28800   1.940     17.24  1999
649          Transit       1         2.70339   1.470    178.00  2013
784  Radial Velocity       3       580.00000   0.947    135.00  2012

[498 rows x 6 columns]

In [42]:
df.groupby("method")["mass"].mean()

method
Astrometry                            NaN
Eclipse Timing Variations        5.125000
Imaging                               NaN
Microlensing                          NaN
Orbital Brightness Modulation         NaN
Pulsar Timing                         NaN
Pulsation Timing Variations           NaN
Radial Velocity                  2.630699
Transit                          1.470000
Transit Timing Variations             NaN
Name: mass, dtype: float64

In [45]:
df.groupby("method")["mass"].sum()

method
Astrometry                          0.00000
Eclipse Timing Variations          10.25000
Imaging                             0.00000
Microlensing                        0.00000
Orbital Brightness Modulation       0.00000
Pulsar Timing                       0.00000
Pulsation Timing Variations         0.00000
Radial Velocity                  1341.65638
Transit                             1.47000
Transit Timing Variations           0.00000
Name: mass, dtype: float64

In [48]:
df.groupby("method")["orbital_period"].describe()

,count,mean,std,min,25%,50%,75%,max
method,,,,,,,,
Astrometry,2.0,631.180000,544.217663,246.360000,438.770000,631.180000,823.590000,1016.000000
Eclipse Timing Variations,9.0,4751.644444,2499.130945,1916.250000,2900.000000,4343.500000,5767.000000,10220.000000
Imaging,12.0,118247.737500,213978.177277,4639.150000,8343.900000,27500.000000,94250.000000,730000.000000
Microlensing,7.0,3153.571429,1113.166333,1825.000000,2375.000000,3300.000000,3550.000000,5100.000000
Orbital Brightness Modulation,3.0,0.709307,0.725493,0.240104,0.291496,0.342887,0.943908,1.544929
Pulsar Timing,5.0,7343.021201,16313.265573,0.090706,25.262000,66.541900,98.211400,36525.000000
Pulsation Timing Variations,1.0,1170.000000,NaN,1170.000000,1170.000000,1170.000000,1170.000000,1170.000000
Radial Velocity,553.0,823.354680,1454.926210,0.736540,38.021000,360.200000,982.000000,17337.500000
Transit,397.0,21.102073,46.185893,0.355000,3.160630,5.714932,16.145700,331.600590
Transit Timing Variations,3.0,79.783500,71.599884,22.339500,39.675250,57.011000,108.505500,160.000000

## **İleri Toplulaştırma İşlemleri** **(Aggregate,filter,transform,apply)**

In [55]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2": [100,253,333,262,111,969]},
                  columns=["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [51]:
#aggregate

In [53]:
df.groupby("gruplar").mean()

         degisken1  degisken2
gruplar
A               16        181
B               17        182
C               66        651

In [57]:
df.groupby("gruplar").aggregate(["min",np.median,max])  # min ve max pandas
#içerisinde bulunduğu için direkt veya tırnakla yazabildik ama medianı
#numpydan çağırdığımız için tırnakla yazamayız.

        degisken1            degisken2
              min median max       min median  max
gruplar
A              10     16  22       100    181  262
B              11     17  23       111    182  253
C              33     66  99       333    651  969

In [58]:
df.groupby("gruplar").aggregate({"degisken1":"min","degisken2":"max"})

         degisken1  degisken2
gruplar
A               10        262
B               11        253
C               33        969

In [65]:
#filter->kendi kişisel fonksiyonlarımızı değişkenler üzerinde sorgulamaya denir

In [60]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2": [100,253,333,262,111,969]},
                  columns=["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [62]:
def filter_func(x):
    return x["degisken1"].std() > 9

In [64]:
df.groupby("gruplar").std()

         degisken1   degisken2
gruplar
A         8.485281  114.551299
B         8.485281  100.409163
C        46.669048  449.719913

In [63]:
df.groupby("gruplar").filter(filter_func)

  gruplar  degisken1  degisken2
2       C         33        333
5       C         99        969

In [66]:
#transform->değişkenler üzerinde kendi tanımladığın fonk. gezdirmeye yarar.

In [67]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2": [100,253,333,262,111,969]},
                  columns=["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [72]:
df_a = df.iloc[:,1:3]

In [75]:
df_a.transform(lambda x: (x-x.mean())/(x.std()))

   degisken1  degisken2
0  -0.687871  -0.738461
1  -0.299074  -0.263736
2   0.000000  -0.015514
3  -0.328982  -0.235811
4  -0.657963  -0.704331
5   1.973890   1.957853

In [76]:
#apply->df üzerinde gezen aggregation fonksiyonudur.

In [82]:
import pandas as pd
import numpy as np
df = pd.DataFrame({"gruplar":["A","B","C","A","B","C"],
                  "degisken1": [10,23,33,22,11,99],
                  "degisken2": [100,253,333,262,111,969]},
                  columns=["gruplar","degisken1","degisken2"])
df

  gruplar  degisken1  degisken2
0       A         10        100
1       B         23        253
2       C         33        333
3       A         22        262
4       B         11        111
5       C         99        969

In [78]:
df.apply(np.sum)

degisken1     198
degisken2    2028
dtype: int64

In [81]:
df.apply(np.mean)

degisken1     33.0
degisken2    338.0
dtype: float64

In [83]:
df.groupby("gruplar").apply(np.sum)

        gruplar  degisken1  degisken2
gruplar
A            AA         32        362
B            BB         34        364
C            CC        132       1302

## **Pivot Tablolar**

In [84]:
import pandas as pd
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [86]:
titanic.groupby('sex')[['survived']].mean()

        survived
sex
female  0.742038
male    0.188908

In [92]:
titanic.groupby(["sex","class"])[['survived']].aggregate("mean").unstack()

        survived
class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [93]:
# pivot table

In [94]:
titanic.pivot_table("survived",index="sex",columns="class")

class      First    Second     Third
sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [95]:
age = pd.cut(titanic["age"], [10,18,90])
age.head()

0    (18, 90]
1    (18, 90]
2    (18, 90]
3    (18, 90]
4    (18, 90]
Name: age, dtype: category
Categories (2, interval[int64]): [(10, 18] < (18, 90]]

In [96]:
titanic.pivot_table("survived", ["sex",age], "class")

class               First    Second     Third
sex    age
female (10, 18]  1.000000  1.000000  0.523810
       (18, 90]  0.972973  0.900000  0.423729
male   (10, 18]  0.666667  0.000000  0.103448
       (18, 90]  0.375000  0.071429  0.133663

## **Dış Kaynaklı Veri Okuma**

In [97]:
import pandas as pd

In [99]:
# pd.read_csv("Machine Learning/ornekcsv.csv", sep=";")  sep: ayrım operatörü

In [100]:
# pd.read_csv("Machine Learning/ornektxt.txt")

In [101]:
# pd.read_excel("Machine Learning/ornekx.xlsx")